rick1082/sdk-nrf/samples/bluetooth/bap_unicast_server_nrf54l15/src/main.c
/*
 * Copyright (c) 2021-2023 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/types.h>
#include <stddef.h>
#include <errno.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/printk.h>
#include <zephyr/audio/dmic.h>
#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/byteorder.h>
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/audio/audio.h>
#include <zephyr/bluetooth/audio/bap.h>
#include <zephyr/bluetooth/audio/pacs.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/drivers/clock_control/nrf_clock_control.h>
#include <dk_buttons_and_leds.h>
#include <hal/nrf_gpio.h>
#include "sw_codec_lc3.h"
#include <nrfx_pdm.h>

#if defined(NRF54L15_XXAA)
#include <hal/nrf_clock.h>
#endif /* defined(NRF54L15_XXAA) */
#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(app);

#define AVAILABLE_SINK_CONTEXT	 BT_AUDIO_CONTEXT_TYPE_ANY
#define AVAILABLE_SOURCE_CONTEXT BT_AUDIO_CONTEXT_TYPE_ANY

NET_BUF_POOL_FIXED_DEFINE(tx_pool, CONFIG_BT_ASCS_MAX_ASE_SRC_COUNT,
			  BT_ISO_SDU_BUF_SIZE(CONFIG_BT_ISO_TX_MTU),
			  CONFIG_BT_CONN_TX_USER_DATA_SIZE, NULL);

#define GAIN_UP_BTN				DK_BTN3_MSK
#define GAIN_DOWN_BTN			DK_BTN4_MSK
#define GAIN_STEP				5
#define GAIN_DEFAULT			NRF_PDM_GAIN_DEFAULT
#define MAX_SAMPLE_RATE			16000
#define MAX_FRAME_DURATION_US	7500
#define MAX_NUM_SAMPLES			((MAX_FRAME_DURATION_US * MAX_SAMPLE_RATE) / USEC_PER_SEC)
#define TOTAL_BUF_NEEDED		4
static K_SEM_DEFINE(lc3_encoder_sem, 0U, TOTAL_BUF_NEEDED);
#define SAMPLE_BIT_WIDTH 16
#define BYTES_PER_SAMPLE sizeof(int16_t)
#define PDM_CLK_PIN     NRF_GPIO_PIN_MAP(1, 12)
#define PDM_DIN_PIN     NRF_GPIO_PIN_MAP(1, 13)
#define PDM_NL DT_NODELABEL(pdm20)
#define PDM_BUF_SIZE        120 // 16000Hz * 7.5ms / 1000us = 120 samples per frame

static int16_t m_pdm_buffer_a[PDM_BUF_SIZE]; // Example using two buffers for release/request cycle
static int16_t m_pdm_buffer_b[PDM_BUF_SIZE];
static bool buffer_a_in_use = true;
static nrfx_pdm_t pdm_inst = NRFX_PDM_INSTANCE(20);
static volatile bool pdm_data_ready_flag = false;
static volatile int16_t *p_latest_pdm_buffer = NULL;

static void nrfx_pdm_event_handler(nrfx_pdm_evt_t const * const p_evt)
{
	nrfx_err_t err;

	if (p_evt->buffer_requested) {
		// Handle buffer request
		//LOG_INF("PDM buffer requested");
		if (buffer_a_in_use) {
            err = nrfx_pdm_buffer_set(&pdm_inst, m_pdm_buffer_b, PDM_BUF_SIZE);
            buffer_a_in_use = false; // Buffer A was just released (or is initial), B is now set for filling
        } else {
            err = nrfx_pdm_buffer_set(&pdm_inst, m_pdm_buffer_a, PDM_BUF_SIZE);
            buffer_a_in_use = true; // Buffer B was just released, A is now set for filling
        }
	}

	if (p_evt->buffer_released) {
		// Handle released buffer
		//LOG_INF("PDM buffer released");
		p_latest_pdm_buffer = p_evt->buffer_released; // Store pointer to the filled buffer
        pdm_data_ready_flag = true;
	}

	if (p_evt->error != NRFX_PDM_NO_ERROR) {
		LOG_INF("PDM error occurred: %d", p_evt->error);
	}
}

static int16_t send_pcm_data[MAX_NUM_SAMPLES];
static const struct bt_audio_codec_cap lc3_codec_cap = BT_AUDIO_CODEC_CAP_LC3(
	BT_AUDIO_CODEC_CAP_FREQ_16KHZ, BT_AUDIO_CODEC_CAP_DURATION_7_5,
	BT_AUDIO_CODEC_CAP_CHAN_COUNT_SUPPORT(1), 30u, 120u, 1u, BT_AUDIO_CONTEXT_TYPE_ANY);

static struct bt_conn *default_conn;
static struct bt_bap_stream sink_streams[CONFIG_BT_ASCS_MAX_ASE_SNK_COUNT];
static struct audio_source {
	struct bt_bap_stream stream;
	uint16_t seq_num;
	uint16_t max_sdu;
	size_t len_to_send;
} source_streams[CONFIG_BT_ASCS_MAX_ASE_SRC_COUNT];
static int configured_octets_per_frame;
static size_t configured_source_stream_count;

static const struct bt_bap_qos_cfg_pref qos_pref =
	BT_BAP_QOS_CFG_PREF(true, BT_GAP_LE_PHY_2M, 0x02, 10, 10000, 40000, 10000, 40000);

static K_SEM_DEFINE(sem_disconnected, 0, 1);

static uint8_t unicast_server_addata[] = {
	BT_UUID_16_ENCODE(BT_UUID_ASCS_VAL),	/* ASCS UUID */
	BT_AUDIO_UNICAST_ANNOUNCEMENT_TARGETED, /* Target Announcement */
	BT_BYTES_LIST_LE16(AVAILABLE_SINK_CONTEXT),
	BT_BYTES_LIST_LE16(AVAILABLE_SOURCE_CONTEXT),
	0x00, /* Metadata length */
};

/* TODO: Expand with BAP data */
static const struct bt_data ad[] = {
	BT_DATA_BYTES(BT_DATA_FLAGS, (BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR)),
	BT_DATA_BYTES(BT_DATA_UUID16_ALL, BT_UUID_16_ENCODE(BT_UUID_ASCS_VAL)),
	BT_DATA(BT_DATA_SVC_DATA16, unicast_server_addata, ARRAY_SIZE(unicast_server_addata)),
	BT_DATA(BT_DATA_NAME_COMPLETE, CONFIG_BT_DEVICE_NAME, sizeof(CONFIG_BT_DEVICE_NAME) - 1),
};

#define AUDIO_VOLUME		(INT16_MAX - 3000) /* codec does clipping above INT16_MAX - 3000 */

#define ACL_LINK_STATUS	  DK_LED1
#define ISO_STREAM_STATUS DK_LED2

#define LC3_ENCODER_STACK_SIZE 8192
#define LC3_ENCODER_PRIORITY   5
static void dmic_fetch_thread(void *arg1, void *arg2, void *arg3);
K_THREAD_DEFINE(dmic_fetch, LC3_ENCODER_STACK_SIZE, dmic_fetch_thread, NULL, NULL, NULL,
		LC3_ENCODER_PRIORITY, 0, -1);

static uint16_t get_and_incr_seq_num(const struct bt_bap_stream *stream)
{
	for (size_t i = 0U; i < configured_source_stream_count; i++) {
		if (stream == &source_streams[i].stream) {
			uint16_t seq_num;

			seq_num = source_streams[i].seq_num;
			source_streams[i].seq_num++;

			return seq_num;
		}
	}

	LOG_INF("Could not find endpoint from stream %p", stream);

	return 0;
}

void print_hex(const uint8_t *ptr, size_t len)
{
	while (len-- != 0) {
		LOG_INF("%02x", *ptr++);
	}
}

static void print_codec_cfg(const struct bt_audio_codec_cfg *codec_cfg)
{
	LOG_INF("codec_cfg 0x%02x cid 0x%04x vid 0x%04x count %u", codec_cfg->id, codec_cfg->cid,
		codec_cfg->vid, codec_cfg->data_len);

	if (codec_cfg->id == BT_HCI_CODING_FORMAT_LC3) {
		enum bt_audio_location chan_allocation;
		int ret;

		ret = bt_audio_codec_cfg_get_freq(codec_cfg);
		if (ret > 0) {
			LOG_INF("  Frequency: %d Hz", bt_audio_codec_cfg_freq_to_freq_hz(ret));
		}

		ret = bt_audio_codec_cfg_get_frame_dur(codec_cfg);
		if (ret > 0) {
			LOG_INF("  Frame Duration: %d us",
				bt_audio_codec_cfg_frame_dur_to_frame_dur_us(ret));
		}

		ret = bt_audio_codec_cfg_get_chan_allocation(codec_cfg, &chan_allocation, false);
		if (ret == 0) {
			LOG_INF("  Channel allocation: 0x%x", chan_allocation);
		}

		LOG_INF("  Octets per frame: %d (negative means value not present)",
			bt_audio_codec_cfg_get_octets_per_frame(codec_cfg));
		LOG_INF("  Frames per SDU: %d",
			bt_audio_codec_cfg_get_frame_blocks_per_sdu(codec_cfg, true));
	} else {
		print_hex(codec_cfg->data, codec_cfg->data_len);
	}
}

static void print_qos(const struct bt_bap_qos_cfg *qos)
{
	LOG_INF("QoS: interval %u framing 0x%02x phy 0x%02x sdu %u "
		"rtn %u latency %u pd %u",
		qos->interval, qos->framing, qos->phy, qos->sdu, qos->rtn, qos->latency, qos->pd);
}

static void send_data()
{
	int ret;
	uint8_t lc3_encoded_buffer[CONFIG_BT_ISO_TX_MTU];
	uint16_t encoded_bytes_written;
	struct net_buf *buf;

