rick1082/sdk-nrf/samples/bluetooth/bap_unicast_server_nrf54l15/src/main.c
	err = nrfx_pdm_start(&pdm_inst);
	if (err != NRFX_SUCCESS) {
		LOG_INF(">> nrfx_pdm_start failed: %d", err);
	} else {
		LOG_INF(">> nrfx_pdm_start OK");
	}
	while (true) {
		k_sem_take(&lc3_encoder_sem, K_MSEC(8));
		if(pdm_data_ready_flag == true){
			memcpy(send_pcm_data, p_latest_pdm_buffer, MAX_NUM_SAMPLES * BYTES_PER_SAMPLE);
			pdm_data_ready_flag = false;
		}
		/*
		ret = dmic_read(dmic_dev, 0, &buffer, &size, 10);
		if (ret < 0) {
			LOG_INF("DMIC read failed: %d", ret);
		}
		if (size > sizeof(send_pcm_data)) {
			LOG_INF("Buffer size exceeds send_pcm_data size, size = %d, send_pcm_data size = %zu",
				size, sizeof(send_pcm_data));
			size = sizeof(send_pcm_data);
		}
		memcpy(send_pcm_data, buffer, size);

		k_mem_slab_free(&mem_slab, buffer);
		*/
		send_data();
	}
}

static int pdm_mic_init()
{
	nrfx_err_t err;

	IRQ_CONNECT(DT_IRQN(PDM_NL), DT_IRQ(PDM_NL, priority), nrfx_isr, nrfx_pdm_20_irq_handler, 0);
	irq_enable(DT_IRQN(PDM_NL));
    nrfx_pdm_config_t pdm_cfg = NRFX_PDM_DEFAULT_CONFIG(PDM_CLK_PIN, PDM_DIN_PIN);
    pdm_cfg.mode       = NRF_PDM_MODE_MONO;
    pdm_cfg.edge       = NRF_PDM_EDGE_LEFTFALLING;
    pdm_cfg.skip_gpio_cfg = false;
    pdm_cfg.skip_psel_cfg = false;
	pdm_cfg.prescaler = 25;
    pdm_cfg.ratio     = NRF_PDM_RATIO_80X;
    pdm_cfg.gain_l        = NRF_PDM_GAIN_DEFAULT;
    pdm_cfg.gain_r        = NRF_PDM_GAIN_DEFAULT;
    pdm_cfg.interrupt_priority = 2;

    err = nrfx_pdm_init(&pdm_inst, &pdm_cfg, nrfx_pdm_event_handler);
    if (err != NRFX_SUCCESS) {
        LOG_INF(">> nrfx_pdm_init failed: %d", err);
    }
    LOG_INF(">> nrfx_pdm_init OK");


	return 0;
}

/* Handles button state changes and adjusts PDM gain accordingly */
static void button_changed(uint32_t button_state, uint32_t has_changed)
{
	static uint8_t pdm_gain = NRF_PDM_GAIN_DEFAULT;
	if ((button_state & has_changed) & GAIN_UP_BTN) {
		if (pdm_gain + GAIN_STEP < NRF_PDM_GAIN_MAXIMUM) {
			pdm_gain += GAIN_STEP;
			nrf_pdm_gain_set(NRF_PDM20_S, pdm_gain, pdm_gain);
			LOG_INF("Gain set to %d", pdm_gain);
		} else {
			nrf_pdm_gain_set(NRF_PDM20_S, NRF_PDM_GAIN_MAXIMUM, NRF_PDM_GAIN_MAXIMUM);
			LOG_INF("Gain is already at maximum");
		}
	} else if ((button_state & has_changed) & GAIN_DOWN_BTN) {
		if (pdm_gain - GAIN_STEP > 0) {
			pdm_gain -= GAIN_STEP;
			nrf_pdm_gain_set(NRF_PDM20_S, pdm_gain, pdm_gain);
			LOG_INF("Gain set to %d", pdm_gain);
		} else {
			nrf_pdm_gain_set(NRF_PDM20_S, NRF_PDM_GAIN_MINIMUM, NRF_PDM_GAIN_MINIMUM);
			LOG_INF("Gain is already at minimum");
		}
	}
}

int main(void)
{
	struct bt_le_ext_adv *adv;
	int err;

	err = clocks_start();
	if (err) {
		LOG_INF("Failed to start clocks (err %d)", err);
		return 0;
	}

	err = dk_leds_init();
	if (err) {
		LOG_ERR("Cannot init LEDs (err: %d)", err);
	}

	err = dk_buttons_init(button_changed);
	if (err) {
		LOG_ERR("Cannot init buttons (err: %d)", err);
	}

	err = pdm_mic_init();
	if (err) {
		LOG_ERR("Cannot init PDM mic (err: %d)", err);
	}

	err = bt_enable(NULL);
	if (err != 0) {
		LOG_INF("Bluetooth init failed (err %d)", err);
		return 0;
	}

	LOG_INF("Bluetooth initialized");

	err = sw_codec_lc3_init(NULL, NULL, MAX_FRAME_DURATION_US);
	if (err) {
		LOG_INF("sw_codec_lc3_init failed (err %d)", err);
	}

	bt_bap_unicast_server_register(&param);
	bt_bap_unicast_server_register_cb(&unicast_server_cb);

	bt_pacs_cap_register(BT_AUDIO_DIR_SINK, &cap_sink);
	bt_pacs_cap_register(BT_AUDIO_DIR_SOURCE, &cap_source);

	for (size_t i = 0; i < ARRAY_SIZE(sink_streams); i++) {
		bt_bap_stream_cb_register(&sink_streams[i], &stream_ops);
	}

	for (size_t i = 0; i < ARRAY_SIZE(source_streams); i++) {
		bt_bap_stream_cb_register(&source_streams[i].stream, &stream_ops);
	}

	err = set_location();
	if (err != 0) {
		return 0;
	}

	err = set_supported_contexts();
	if (err != 0) {
		return 0;
	}

	err = set_available_contexts();
	if (err != 0) {
		return 0;
	}

	/* Create a connectable advertising set */
	err = bt_le_ext_adv_create(BT_LE_EXT_ADV_CONN, NULL, &adv);
	if (err) {
		LOG_INF("Failed to create advertising set (err %d)", err);
		return 0;
	}

	err = bt_le_ext_adv_set_data(adv, ad, ARRAY_SIZE(ad), NULL, 0);
	if (err) {
		LOG_INF("Failed to set advertising data (err %d)", err);
		return 0;
	}

	k_thread_start(dmic_fetch);

	while (true) {
		err = bt_le_ext_adv_start(adv, BT_LE_EXT_ADV_START_DEFAULT);
		if (err) {
			LOG_INF("Failed to start advertising set (err %d)", err);
			return 0;
		}

		LOG_INF("Advertising successfully started");

		err = k_sem_take(&sem_disconnected, K_FOREVER);
		if (err != 0) {
			LOG_INF("failed to take sem_disconnected (err %d)", err);
			return 0;
		}

		/* reset data */
		configured_source_stream_count = 0U;
	}
	return 0;
}
